Revit 2016 API
Rectangle Constructor
 Create an empty Rectangle instance with values (0,0,0,0).
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public Rectangle()
Visual Basic
Public Sub New
Visual C++
public:
Rectangle()
See Also
Rectangle Class
Rectangle Overload
Autodesk.Revit.UI Namespace